# Brewfile —— 一键安装所有 App 与 CLI 工具
#
# 使用方法（安装好 Homebrew 后）：
#   brew bundle --file=./Brewfile
#
# 说明：
#   brew    -> Homebrew Formulae（CLI 工具）
#   cask    -> Homebrew Cask（图形界面 App）
#   有代理的可以先开代理再执行，速度会快很多。

# ---------------- CLI 工具（以字母排序，方便查找）----------------
brew "autojump"            # 目录快速跳转
brew "bat"                 # cat 的高亮增强版
brew "diff-so-fancy"       # 更好看的 git diff
brew "fzf"                 # 模糊查找
brew "git"
brew "hub"                 # GitHub 增强的 git
brew "lazygit"             # 终端里的 git GUI
brew "nvm"                 # Node 版本管理
brew "pnpm"
brew "the_silver_searcher" # ag，超快的代码搜索
brew "tldr"                # 简化版 man
brew "tree"
brew "ugit"                # 误操作恢复 git
brew "wget"

# ---------------- 图形界面 App（以字母排序，方便查找）----------------
cask "1password"
cask "alfred"
cask "anki"
cask "apifox"
cask "coteditor"
cask "datagrip"
cask "docker"
cask "espanso"
cask "figma"
cask "gas-mask"
cask "ghostty"                   # 现代终端，已取代 iTerm2
cask "goland"
cask "google-chrome"
cask "iterm2"                    # 旧主力终端，保留备用
cask "karabiner-elements"
cask "keepingyouawake"
cask "microsoft-remote-desktop"
cask "mos"
cask "ngrok"
cask "obs"
cask "obsidian"
cask "qq"
cask "setapp"
cask "shottr"
cask "thor"
cask "usr-sse2-rdm"
cask "visual-studio-code"
cask "webstorm"
cask "wechat"
cask "zerotier-one"
